import os
import subprocess


os.system('mode con: lines=60 cols=145')


def ninjagomenu():
    while True:
        try:
            os.system('cls')
            ninjapic = """
            +-----------------------------------------------------------------------+
            | +-------------------------------------------------------------------+ |
            | |,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |

                    _______  .__            __         ________        
                    \      \ |__| ____     |__|____   /  _____/  ____  
                    /   |   \|  |/    \    |  \__  \ /   \  ___ /  _ \ 
                   /    |    \  |   |  \   |  |/ __ \     \_\  (  <_> )
                   \____|__  /__|___|  /\__|  (____  /\______  /\____/ 
                           \/        \/\______|    \/        \/        

            | |,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |                           
            | +---------------------------------------------------------------/dd\| |
            | +------------------------------------------------------------'+dNMMMM\|                          
            | |                       _^_                                  :mMMMMMMMN:                         
            | |                     /MM|                                  oNMMMmy+:---                         
            | |                   /omNN/             .-/+oosyysso+:-'     sMMNs-' | | .^\                       
            | |                 /sNMMM/         ':+ymNNMMMMMMMMMMMMNNdy/-oMMN:    | /omNo\                      
            | |               :mMMMMM/       ':ymNMMMMMMMMMMMMMMMMMMMMMMNMMMo   './ymMMMNh.\                  
            | |              :NMMMMM/      '/dNMMMMMMMMMMMMMMMMMMMMMMMMMMMMMhsyhmNMMMMMMmho->                  
            | |            .mMMMMMM|    -dMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMmddhyys+:.'                      
            | |            oMMMMMMM|     /NMMMMMMMMMMNmmmddddddddmmNMMMMMMMMMMMd.'| |                             
            | |            mMMMMMMM|    :NMMMMMmdyo/--..'''   ''''..-:+ydmMMMMMMh'| |                              
            | |           -MMMMMMMM|   'dMMMdo:.'                         /ymMMMMo| |                              
            | |           oMMMMMMMN.   /MMm/'     .+-               '//'    .omMMN| |                              
            | |           oMMMMMMMm'   +MM+       dMN:              yMM/      /MMM| |                             
            | |           /MMMMMMMd    :MMm:'     /hs.              /hy.     -dMMN| |                              
            | |           'MMMMMMMd    'dMMNh/.                          '.:yNMMMo| |                              
            | |            dMMMMMMm'    -NMMMMmho/-.                 .-/shmMMMMMh'| |                              
            | |            /MMMMMMN.     -mMMMMMMMMNmdhyysooooosyyhdmNMMMMMMMMMy' | |                              
            | |             hMMMMMM:      .sNMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMm+   | |                              
            | |             .mMMMMMy        -yNMMMMMMMMMMMMMMMMMMMMMMMMMMMMmo'    | |                              
            | |              -NMMMMN.         .odNMMMMMMMMMMMMMMMMMMMMMNNh/'      | |                              
            | |               :NMMMMs           ':yMMMMMMMMMMMMMMMMMMMNo.         | |                              
            | |                -mMMMM-       ':sdMMMMMMMMMMMMMMMMMMMMMMMNh+-'     | |                              
            | |                 .hMMMd'   '/hNMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMms:   | |                              
            | |                   +NMMy':yNMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMmo.| |                              
            | |                    -mMMNMMMMMMMmdhmMMMMMMMMMMMMMMMMMMMMdhmNMMMMMMMh/.:'                         
            | |                   'sMMMMMMMdo/.   +MMMMMMMMMMMMMMMMMMMM.  '-+ydMMMMMMMN+                        
            | |                   'yMMMMMMM/      sMMMMMMMMMMMMMMMMMMMM-       'oMMMMMN+                        
            | |                     +dMNhdy.      dMMMMMMMMMMMMMMMMMMMM+        '+dMMy-                         
            | |                      '-. '       'mMMMMMMMMMMMMMMMMMMMMs          '.-                           
            | |                                 'oNMMMMMMMMMMMMMMMMMMMMm/         | |                              
            | |  1. PC Setup TOOLS             /dMMMMMMMMMMMMMMMMMMMMMMMNy.       | |                              
            | |  2. Set NuPoint Permissions  'yMMMMMMMMMMNmddddmNMMMMMMMMMm/      | |                              
            | |  3. Install Applications    'hMMMMMMMMNy/.''''''./hMMMMMMMMN/     | |                              
            | |  4. Dell Command Update     yMMMMMMMMd-           '+NMMMMMMMN-    | |                              
            | |  5. Get PC Information     -NMMMMMMMm.              oMMMMMMMMh    | |                              
            | |  6. Quit                   sMMMMMMMMs               'mMMMMMMMM:   | |                              
            | |                           'ydmmmmmdd:                sdmmmmmdd/   | |                             
            | |                             ''...'''                  '''..'''    | | 
            | +-------------------------------------------------------------------+ |
            +-----------------------------------------------------------------------+"""
            print(ninjapic)
            selection = int(input("""             _________  __     Make a numbered selection... ____.           ________     
             \_   ___ \|  |__   ____   ____  ______ ____   /_   |          /  _____/   
             /    \  \/|  |  \ /  _ \ /  _ \/  ___// __ \   |   |  ______ /   __  \    
             \     \___|   Y  (  <_> |  <_> )___ \   ___/   |   | /_____/ \  |__\  \   
              \______  /___|  /\____/ \____/____  >\___  >  |___|          \_____  /   
                     \/     \/                  \/     \/                        \/ ... :  """))
            if selection == 1:
                os.system("cls")
                adminmenu()
            elif selection == 2:
                os.system("cls")
                nupoint()
                input("Press ENTER to continue...")
            elif selection == 3:
                os.system("cls")
                installappsmenu()
                input("Press ENTER to continue...")
            elif selection == 4:
                os.system("cls")
                dellcu = """Write-Host -ForegroundColor Blue "
           __________________________________________________________________
           |+_.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-.__+|
           |.-|--- --   - ---   --     ---   -----   - --  -  ----  --  -|-.|
           | )|              ________         .__  .__                   |( |
           |( |              \______ \   ____ |  | |  |                  | )|
           | )|               |    |  \_/ __ \|  | |  |                  |( |
           |( |               |  |_|   \  ___/|  |_|  |__                | )|
           | )|              /_______  /\___  >____/____/                |( |
           |( |                      \/     \/                           | )|
           | )| _________                                           .___ |( |
           |( | \_   ___ \  ____   _____   _____ _____    ____    __| _/ | )|
           | )| /    \  \/ /  _ \ /     \ /     \ __  \  /    \  / __ |  |( |
           |( | \     \___(  <_> )  Y Y  \  Y Y  \/ __ \|   |  \/ /_/ |  | )|
           | )|  \______  /\____/|__|_|  /__|_|  (____  /___|  /\____ |  |( |
           |( |         \/             \/      \/     \/     \/      \/  | )|
           | )|                           .___       __                  |( |
           |( |           __ ________   __| _/____ _/  |_  ____          | )|
           | )|          |  |  \____ \ / __ |\__  \    __\/ __ \         |( |
           |( |          |  |  /  |_> > /_/ | / __ \|  | \  ___/         | )|
           | )|          |____/|   __/\____ |(____  /__|  \___  >        |( |
           |( |                |__|        \/     \/          \/         | )|
           | )|                                                          |( |
           |((|'°º¤ø,¸,ø¤°'º¤ø,¸( •_•)O*¯·.¸.·´¯°Q(•_• )¸,ø¤°'º¤ø,¸¸,ø¤º°|))|
           | )).-=-._.-=-._.-=-._.-=-._.-=-..-=-._.-=-._.-=-._.-=-._.-=-.(( |
           |(( .-.---   ---    --    ---   -----   - --  ----     ----.-. ))|"                
                        $TestFile = "C:\Program Files (x86)\Dell\CommandUpdate\dcu-cli.exe" 
                        Test-Path "$TestFile" -PathType Leaf | Out-Null
                        if ($_ = $False){Start-Process "https://downloads.dell.com/FOLDER05055451M/1/Dell-Command-Update_DDVDP_WIN_2.4.0_A00.EXE"; Write-Host -ForegroundColor Magenta "           | ))==========================================================(( |
           |((            Downloading Install...                          ))|
           | ))==========================================================(( |"} 
                        else {Start-Process "C:\Program Files (x86)\Dell\CommandUpdate\dcu-cli.exe"; Write-Host -ForegroundColor Green "           | ))==========================================================(( |
           |((            Running Console Update...                       ))|
           | ))=============================================================="} """
                subprocess.call(['powershell.exe', dellcu])
                input("""                   Press Enter to continue... """)
            elif selection == 5:
                os.system("cls")
                gpccmd = """ Clear-Host

                  "##############################################################################################"
                write-host -BackgroundColor Black -ForegroundColor Blue "
                 ██░ ██  ▒█████    ██████ ▄▄▄█████▓ ███▄    █  ▄▄▄       ███▄ ▄███▓▓█████ 
                ▓██░ ██▒▒██▒  ██▒▒██    ▒ ▓  ██▒ ▓▒ ██ ▀█   █ ▒████▄    ▓██▒▀█▀ ██▒▓█   ▀ 
                ▒██▀▀██░▒██░  ██▒░ ▓██▄   ▒ ▓██░ ▒░▓██  ▀█ ██▒▒██  ▀█▄  ▓██    ▓██░▒███   
                ░▓█ ░██ ▒██   ██░  ▒   ██▒░ ▓██▓ ░ ▓██▒  ▐▌██▒░██▄▄▄▄██ ▒██    ▒██ ▒▓█  ▄ 
                ░▓█▒░██▓░ ████▓▒░▒██████▒▒  ▒██▒ ░ ▒██░   ▓██░ ▓█   ▓██▒▒██▒   ░██▒░▒████▒
                 ▒ ░░▒░▒░ ▒░▒░▒░ ▒ ▒▓▒ ▒ ░  ▒ ░░   ░ ▒░   ▒ ▒  ▒▒   ▓▒█░░ ▒░   ░  ░░░ ▒░ ░
                 ▒ ░▒░ ░  ░ ▒ ▒░ ░ ░▒  ░ ░    ░    ░ ░░   ░ ▒░  ▒   ▒▒ ░░  ░      ░ ░ ░  ░
                 ░  ░░ ░░ ░ ░ ▒  ░  ░  ░    ░         ░   ░ ░   ░   ▒   ░      ░      ░   
                 ░  ░  ░    ░ ░        ░                    ░       ░  ░       ░      ░  ░
                                                                                          "     
                   "##############################################################################################"
                     hostname
                   "###############################################################################################"
                   pause
                   Clear-Host   
                 write-host -BackgroundColor Black -ForegroundColor Green "  
                 ██▓ ██▓███      ▄████▄   ▒█████   ███▄    █   █████▒ ██▓  ▄████  
                ▓██▒▓██░  ██▒   ▒██▀ ▀█  ▒██▒  ██▒ ██ ▀█   █ ▓██   ▒ ▓██▒ ██▒ ▀█▒ 
                ▒██▒▓██░ ██▓▒   ▒▓█    ▄ ▒██░  ██▒▓██  ▀█ ██▒▒████ ░ ▒██▒▒██░▄▄▄░
                ░██░▒██▄█▓▒ ▒   ▒▓▓▄ ▄██▒▒██   ██░▓██▒  ▐▌██▒░▓█▒  ░ ░██░░▓█  ██▓
                ░██░▒██▒ ░  ░   ▒ ▓███▀ ░░ ████▓▒░▒██░   ▓██░░▒█░    ░██░░▒▓███▀▒
                ░▓  ▒▓▒░ ░  ░   ░ ░▒ ▒  ░░ ▒░▒░▒░ ░ ▒░   ▒ ▒  ▒ ░    ░▓   ░▒   ▒ 
                 ▒ ░░▒ ░          ░  ▒     ░ ▒ ▒░ ░ ░░   ░ ▒░ ░       ▒ ░  ░   ░ 
                 ▒ ░░░          ░        ░ ░ ░ ▒     ░   ░ ░  ░ ░     ▒ ░░ ░   ░  
                 ░              ░ ░          ░ ░           ░          ░        ░ 
                                ░                                                                                                             
                "
                " ##################################################################################################" 
                        ipconfig
                        pause 
                    Clear-Host      
                 "##################################################################################################"
                write-host -BackgroundColor Black -ForegroundColor Blue "
                 ██▓███   ██▀███   ██▓ ███▄    █ ▄▄▄█████▓▓█████  ██▀███    ██████ 
                ▓██░  ██▒▓██ ▒ ██▒▓██▒ ██ ▀█   █ ▓  ██▒ ▓▒▓█   ▀ ▓██ ▒ ██▒▒██    ▒ 
                ▓██░ ██▓▒▓██ ░▄█ ▒▒██▒▓██  ▀█ ██▒▒ ▓██░ ▒░▒███   ▓██ ░▄█ ▒░ ▓██▄   
                ▒██▄█▓▒ ▒▒██▀▀█▄  ░██░▓██▒  ▐▌██▒░ ▓██▓ ░ ▒▓█  ▄ ▒██▀▀█▄    ▒   ██▒
                ▒██▒ ░  ░░██▓ ▒██▒░██░▒██░   ▓██░  ▒██▒ ░ ░▒████▒░██▓ ▒██▒▒██████▒▒
                ▒▓▒░ ░  ░░ ▒▓ ░▒▓░░▓  ░ ▒░   ▒ ▒   ▒ ░░   ░░ ▒░ ░░ ▒▓ ░▒▓░▒ ▒▓▒ ▒ ░
                ░▒ ░       ░▒ ░ ▒░ ▒ ░░ ░░   ░ ▒░    ░     ░ ░  ░  ░▒ ░ ▒░░ ░▒  ░ ░
                ░░         ░░   ░  ▒ ░   ░   ░ ░   ░         ░     ░░   ░ ░  ░  ░  
                            ░      ░           ░             ░  ░   ░           ░  

                "
                 " ##################################################################################################### "

                   Get-Printer -Full | Format-Table -AutoSize -Force -Property Name, DriverName, PortName
                   pause
                   Clear-Host
                "##################################################################################################### "

                write-host -BackgroundColor Black -ForegroundColor Magenta "
                 ███▄ ▄███▓ ▄▄▄       ██▓███   ██▓███  ▓█████ ▓█████▄    ▓█████▄  ██▀███   ██▓ ██▒   █▓▓█████   ██████ 
                ▓██▒▀█▀ ██▒▒████▄    ▓██░  ██▒▓██░  ██▒▓█   ▀ ▒██▀ ██▌   ▒██▀ ██▌▓██ ▒ ██▒▓██▒▓██░   █▒▓█   ▀ ▒██    ▒ 
                ▓██    ▓██░▒██  ▀█▄  ▓██░ ██▓▒▓██░ ██▓▒▒███   ░██   █▌   ░██   █▌▓██ ░▄█ ▒▒██▒ ▓██  █▒░▒███   ░ ▓██▄   
                ▒██    ▒██ ░██▄▄▄▄██ ▒██▄█▓▒ ▒▒██▄█▓▒ ▒▒▓█  ▄ ░▓█▄   ▌   ░▓█▄   ▌▒██▀▀█▄  ░██░  ▒██ █░░▒▓█  ▄   ▒   ██▒
                ▒██▒   ░██▒ ▓█   ▓██▒▒██▒ ░  ░▒██▒ ░  ░░▒████▒░▒████▓    ░▒████▓ ░██▓ ▒██▒░██░   ▒▀█░  ░▒████▒▒██████▒▒
                ░ ▒░   ░  ░ ▒▒   ▓▒█░▒▓▒░ ░  ░▒▓▒░ ░  ░░░ ▒░ ░ ▒▒▓  ▒     ▒▒▓  ▒ ░ ▒▓ ░▒▓░░▓     ░ ▐░  ░░ ▒░ ░▒ ▒▓▒ ▒ ░
                ░  ░      ░  ▒   ▒▒ ░░▒ ░     ░▒ ░      ░ ░  ░ ░ ▒  ▒     ░ ▒  ▒   ░▒ ░ ▒░ ▒ ░   ░ ░░   ░ ░  ░░ ░▒  ░ ░
                ░      ░     ░   ▒   ░░       ░░          ░    ░ ░  ░     ░ ░  ░   ░░   ░  ▒ ░     ░░     ░   ░  ░  ░  
                       ░         ░  ░                     ░  ░   ░          ░       ░      ░        ░     ░  ░      ░  
                                                               ░          ░                        ░                   
                "
                 " ##################################################################################################### "
                   net use

                 " ##################################################################################################### "  
                 """
                subprocess.call(['powershell.exe', gpccmd])
                input("Please press ENTER to continue...")
            elif selection == 6:
                os.system('cls')
                restart = """restart-computer -Confirm"""
                subprocess.call(['powershell.exe', restart])
                exit()
            else:
                print(ninjapic + 'Invalid choice. Enter 1')
                ninjagomenu()
        except ValueError:
            print(ninjapic + 'Invalid choice. Enter 1')
            ninjagomenu()


def adminmenu():
    adminpic = """
            +========================================================================+
            | +--------------------------------------------------------------------+ |
            | | ,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
            | |_____        ___         __          ___________                 __ | |
            | /  _  \    __| _/ _____  |__|  ____   \__    ___/_____     ______|  ||_|  ______
            |/  /_\  \  / __ | /     \ |  | /    \    |    |   \__  \   /  ___/|  |/ / /  ___/
            /    |    \/ /_/ ||  Y Y  \|  ||   |  \   |    |    / __ \_ \___ \ |    <  \___ \ 
            \____|__  /\____ ||__|_|  /|__||___|  /   |____|   (____  //____  >|__|_ \/____  >
            | |     \/      \/      \/          \/                  \/      \/     |\/     \/ 
            | | ,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
            | +------------------------- Admin Tasks ------------------------------+ |
            |   O₪₪₪₪§|(Ξ≥≤≥≤≥≤ΞΞΞΞΞΞΞΞΞΞ>           O₪₪₪₪§|(Ξ≥≤≥≤≥≤ΞΞΞΞΞΞΞΞΞΞ>    | |
            +----------------------------------------------------------------------+ |
            | | ,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸( •_•)O*¯·.¸.·´¯°Q(•_• ),¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
            | |                                                                    | |
            | | [1] Turn Off UAC                    [8] Create System Restore Point| |
            | | [2] Enable Local Administrator      [9] NuPoint Device Certification |
            | | [3] Set Administrator Password      [10] Check Office Activation   | |
            | | [4] Rename Administrator Account    [11] Exit                      | |
            | | [5] Power Configuration Settings                                   | |
            | | [6] Rename Computer                  O                             | |
            | | [7] Enable .NET 3.5                  |                             | |
            | |            _________                 |                             | |
            | |           |MMMMMMMMM|                |                             | |
            |_|______     |MMMMMMMMM|              _|l|_                           | |
            ||!!!!!!!| ___|MMMMMMMMM|             |lllll|                          | |
            ||!!!!!!|=========|MMMMM|             |lllll|_______                   | |
            ||!!!!!!|=========|MMMMM|            _|lllll|HHHHHHH|                  | |
            ||!!!!!!|=========|MMMMM|   ________|lllllllll|HHHHH|                  | |
            ||!!!!!!|=========|MMMMM|  |unununun|lllllllll|HHHHH|______            | |
            ||!!!!!!|=========|MMMMM|  |nunununu|lllllllll|HH|:::::::::|           | |
            ||!!!!!!|=========|MMMMM|..|unununun|lllllllll|HH|:::::::::|           | |
            ||!!!!!!|=======_=|M_( ')' );' .)unu|lllllllll|HH|:::::::::|           | |
            ||!!!_!!|======( )|(. ' ,) (_ ', )un|lllllllll|HH|:::::::::| ~~~       | |
            ||!!(.)!|===__('.')_(_ ')_,)(. _)unu|lllllllll|HH|:::::::::|~~  ~~     | |
            ||!(.'')|==( .)' .)MMM|M|| |un|nunun|lllllllll|''|( ,)_::::| ~~~~ ~    | |
            | -(: _)|=('. ')_)|---|- '  ''|'''''|lll____ll|  (_; ''):::|~~~  ~~~   | |
            |    |  |==(_'_)|=|    ______        ''/\   \    |(_'_)::::|\~~~~__|)__| |
            |    |   ''''|''o/'.-''~~~~~ ''-.     /--\___\    ''|'''''' /____\____/| |
            |____        |  h ( '; ~~~ ~~  ~ )    |M_|#_#|      ' --   __________|~| |
            |      --   *      '-.._~~__~..-'   --           -* -     /  ~~~~ ~~~~~| |
            |*   -   -      --           ----         ---         _.-'~~~~~     ~ ~| |
            |_--_________............-------------'''''''''''''''' ~~~~~    ~~~ ~~~| |
            |~    ~~~~~~~~     ~~~~~~~   ~~~~~~~~~   ~~~~~~~~~~      ~~~~~~~     ~~| |
            |~~~~~~~~  ~~~~  ~~~~~ ~~~~~~~~~ ~ ~      ~~~~~~ ~~~~~~     ~~~~    ~~~| |
            | |.,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸( •_•)O*¯·.¸.·´¯°Q(•_• ),¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
            +========================================================================+"""
    while True:
        try:
            os.system("cls")
            print(adminpic)
            selection = int(input("       Enter choice 1-10:"))
            if selection == 1:
                os.system("cls")
                print(""" 
                                +---------------------------------------------------------------------------+
                                | +-----------------------------------------------------------------------+ |
                                | | ¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ | | 
                                ________  .__             ___.   .__            ____ ___  _____  ________ | |  
                                \______ \ |__| __________ \_ |__ |  |   ____   |    |   \/  _  \ \_   ___ \ |
                                 |    |  \|  |/  ___|__  \ | __ \|  | _/ __ \  |    |   /  /_\  \/    \  \/ |
                                 |  --|   \  |\___ \ / __ \| \_\ \  |_\  ___/  |    |  /    |    \     \____|
                                /_______  /__/____  >____  /___  /____/\___  > |______/\____|__  /\______  /|
                                | |     \/        \/     \/    \/          \/                  \/        \/ |
                                | | ¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø| |
                                | +-----------------------------------------------------------------------+ |
                                +--------------------------------Disable UAC--------------------------------+"
                                                                .do-''''''-o..
                                     ( I wonder if  )        .o''            ''..
                                        ( this is OK...    ,,''                 ''b.
                                                          d'                      ''b
                                                         d'd:                       'b.
                                                        ,,dP                         'Y.
                                                       d'88                           '8.
                                 ooooooooooooooooood888'88'                            '88888888888bo,
                                d'''    '''''''''''''Y:d8P                              8,          'b
                                8                    P,88b                             ,'8           8
                                8                   ::d888,                           ,8:8.          8
                                :                   dY88888                           '' ::          8
                                :                   8:8888                               'b          8
                                :                   Pd88P',...                     ,d888o.8          8
                                :                   :88'dd888888o.                d8888'88:          8
                                :                  ,:Y:d8888888888b             ,d88888:88:          8
                                :                  :::b88d888888888b.          ,d888888bY8b          8
                                                    b:P8;888888888888.        ,88888888888P          8
                                                    8:b88888888888888:        888888888888'          8
                                                    8:8.8888888888888:        Y8888888888P           8
                                ,                   YP88d8888888888P'          ''888888'Y            8
                                :                   :bY8888P'''''''                     :            8
                                :                    8'8888'                            d            8
                                :                    :bY888,                           ,P            8
                                :                     Y,8888           d.  ,-         ,8'            8
                                :                     '8)888:           '            ,P'             8
                                :                      '88888.          ,...        ,P               8
                                :                       'Y8888,       ,888888o     ,P                8
                                :                         Y888b      ,88888888    ,P'                8
                                :                          '888b    ,888888888   ,,'                 8
                                :                           'Y88b  dPY888888OP   :'                  8
                                :                             :88.,'.   '' '8P-'b.                   8
                                :.                             )8P,   ,b '  -   ''b                  8
                                ::                            :':   d,'d'b, .  - ,db                 8
                                ::                            'b. dP' d8':      d88'                 8
                                ::                             '8P' d8P' 8 -  d88P'                  8
                                ::                            d,' ,d8'  ''  dd88'                    8
                                ::                           d'   8P'  d' dd88'8                     8
                                 :                          ,:   ''   d:ddO8P' 'b.                   8
                                 :                  ,dooood88: ,    ,d8888''    '''b.                8
                                 :               .o8''''''''Y8.b    8 ''''    .o'  ''''ob.           8
                                 :              dP'         '8:     K       dP''        ''Yo.        8
                                 :             dP            88     8b.   ,d'              ''b       8
                                 :             8.            8P     8'''  ''                 :.      8
                                 ''ob...............--''''''----------------------''''''''''''''''''''""")
                uaccmd = """$ErrorActionPreference= 'silentlycontinue'
                $osversion = (Get-CimInstance Win32_OperatingSystem).Version
                $version = $osversion.split(".")[0]
                    if ($version -eq 10) 
                        {Set-ItemProperty "HKLM:\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System" -Name "ConsentPromptBehaviorAdmin" -Value "0"; UserAccountControlSettings} 
                    ElseIf ($Version -eq 6) 
                        {$sub = $version.split(".")[1]
                    if ($sub -eq 1 -or $sub -eq 0) 
                        {Set-ItemProperty "HKLM:\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System" -Name "EnableLUA" -Value "0"} 
                    Else {Set-ItemProperty "HKLM:\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System" -Name "ConsentPromptBehaviorAdmin" -Value "0"} 
                    ElseIf ($Version -eq 5) 
                        {Set-ItemProperty "HKLM:\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System" -Name "EnableLUA" -Value "0"} }
                        Else {Set-ItemProperty "HKLM:\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System" -Name "ConsentPromptBehaviorAdmin" -Value "0"}
                        $error[0].Exception
                    """
                subprocess.call(['powershell.exe', uaccmd])
                input("""
                                                   Press Enter to continue... """)
            elif selection == 2:
                os.system("cls")
                setadminpic = """ Write-Host  -ForegroundColor Magenta "
+------------------------------------------------------------------------------------------------------------------+
| |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
| |                              ___________            ___.   .__                                               | |
| |                              \_   _____/ ____ _____ \_ |__ |  |   ____                                       | |
| |                               |    __)_ /    \|__  \ | __ \|  | _/ __ \                                      | |
| |                               |        \   |  \/ __ \| \_\ \  |_\  ___/                                      | |
| |                              /_______  /___|  (____  /___  /____/\___  >                                     | |
| |                                      \/     \/     \/    \/          \/                                      | |
| |                                   .____                        .__                                           | |
| |                                   |    |    ____   ____ _____  |  |                                          | |
| |                                   |    |   /  _ \_/ ___\|__  \ |  |                                          | |
| |                                   |    |__(  <_> )  \___ / __ \|  |__                                        | |
| |                                   |_______ \____/ \___  >____  /____/                                        | |
| |                                           \/          \/     \/                                              | |
| |                  _____       .___      .__       .__          __                 __                          | |
| |                 /  _  \    __| _/_____ |__| ____ |__| _______/  |_____________ _/  |_  ___________           | |
| |                /  /_\  \  / __ |/     \|  |/    \|  |/  ___/\   __\_  __ \__  \    __\/  _ \_  __ |          | |
| |               /    |    \/ /_/ |  Y Y  \  |   |  \  |\___ \  |  |  |  | \// __ \|  | (  <_> )  | \/          | |
| |               \____|__  /\____ |__|_|  /__|___|  /__/____  > |__|  |__|  (____  /__|  \____/|__|             | |
| |                       \/      \/     \/        \/        \/                   \/                             | |
| |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
+------------------------------------------------------------------------------------------------------------------+  
                  "
                  """
                subprocess.call(['powershell.exe', setadminpic])
                setadmincmd = """ $ErrorActionPreference= 'silentlycontinue'; Get-LocalUser -Name "Administrator" | Enable-LocalUser; if ($_ -ne $True) {"
        Error... Check the following things... 
                1. Is the Local Administrator account already enabled?
                2. Make sure it has not been renamed..."} Else {"Admin Account Enabled"}"""
                subprocess.call(['powershell.exe', setadmincmd])
                input("""
                                     Press Enter to continue... """)
            elif selection == 3:
                os.system("cls")
                setadminpass = """
 $ErrorActionPreference= 'silentlycontinue'
 Write-Host -ForegroundColor Blue "
        +------------------------------------------------------------------------------------------------------------------+
        | |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
        | |                                       _________       __                                                     | |
        | |                                      /   _____/ _____/  |_                                                   | |
        | |                                      \_____  \_/ __ \   __\                                                  | |
        | |                                      /        \  ___/|  |                                                    | |
        | |                                     /_______  /\___  >__|                                                    | |
        | |                                      \/     \/                                                               | |
        | |           _____       .___      .__       .__          __                 __                                 | |
        | |          /  _  \    __| _/_____ |__| ____ |__| _______/  |_____________ _/  |_  ___________                  | |
        | |         /  /_\  \  / __ |/     \|  |/    \|  |/  ___/\   __\_  __ \__  \    __\/  _ \_  __ \                 | |
        | |        /    |    \/ /_/ |  Y Y  \  |   |  \  |\___ \  |  |  |  | \// __ \|  | (  <_> )  | \/                 | |
        | |        \____|__  /\____ |__|_|  /__|___|  /__/____  > |__|  |__|  (____  /__|  \____/|__|                    | |
        | |                \/      \/     \/        \/        \/                   \/                                    | |
        | |                  __________                                               .___                               | |
        | |                  \______   \_____    ______ ________  _  _____________  __| _/                               | |
        | |                   |     ___/\__  \  /  ___//  ___/\ \/ \/ /  _ \_  __ \/ __ |                                | |
        | |                   |    |     / __ \_\___ \ \___ \  \     (  <_> )  | \/ /_/ |                                | |
        | |                   |____|    (____  /____  >____  >  \/\_/ \____/|__|  \____ |                                | |
        | |                                  \/     \/     \/                          \/                                | |
        | |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
        +------------------------------------------------------------------------------------------------------------------+ "
 $GLU = Get-LocalUser -Name "Administrator"
 $error[0].Exception | Out-Null
 if ($_ -ne $True) {Write-Host -ForegroundColor Red "        Something prevented the system from getting tht local Administrator account. This process is quitting now..."; exit}
      else {$Password = Read-Host -AsSecureString -Prompt "Type a new Password here "; $UserAccount = Get-LocalUser -Name "Administrator"; $UserAccount | Set-localUser -Password $Password}
 if ($_ -eq $True) {Write-Host -ForegroundColor Green '!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                                !!!!!!!!  Administrator Password Now Set  !!!!!!!!!
!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!'}
                else {Write-Host -ForegroundColor Red "Something went wrong... Administrator password not set... this will exit"}
                """
                subprocess.call(['powershell.exe', setadminpass])
                input("""                                       
                                        Press Enter to continue... """)
            elif selection == 4:
                os.system("cls")
                adminacctrn = """
                $ErrorActionPreference= 'silentlycontinue' 
                $AdminAccount = Read-Host -Prompt "
        +------------------------------------------------------------------------------------------------------------------+
        | |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
        | |                                                                                                              | |
        | |                         __________                                                                           | |
        | |                         \______   \ ____   ____ _____    _____   ____                                        | |
        | |                          |       _// __ \ /    \ __  \  /     \_/ __ \                                       | |
        | |                          |    |   \  ___/|   |  \/ __ \|  Y Y  \  ___/                                       | |
        | |                          |____|_  /\___  >___|  (____  /__|_|  /\___  >                                      | |
        | |                                 \/     \/     \/     \/      \/     \/                                       | |
        | |                                 .____                        .__                                             | |
        | |                                 |    |    ____   ____ _____  |  |                                            | |
        | |                                 |    |   /  _ \_/ ___\ __  \ |  |                                            | |
        | |                                 |    |__(  <_> )  \___ / __ \|  |__                                          | |
        | |                                 |_______ \____/ \___  >____  /____/                                          | |
        | |                                         \/          \/     \/                                                | |
        | |         _____       .___      .__       .__          __                 __                                   | |
        | |        /  _  \    __| _/_____ |__| ____ |__| _______/  |_____________ _/  |_  ___________                    | |
        | |       /  /_\  \  / __ |/     \|  |/    \|  |/  ___/\   __\_  __ \__  \    __\/  _ \_  __ |                   | |
        | |      /    |    \/ /_/ |  Y Y  \  |   |  \  |\___ \  |  |  |  | \// __ \|  | (  <_> )  | \/                   | |
        | |      \____|__  /\____ |__|_|  /__|___|  /__/____  > |__|  |__|  (____  /__|  \____/|__|                      | |
        | |              \/      \/     \/        \/        \/                   \/                                      | |
        | |                                                                                                              | |
        | |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
        +------------------------------------------------------------------------------------------------------------------+
                 Rename the local Administrator account by typing it here"
Get-LocalUser -Name "Administrator"
$error[0].Exception | Out-Null
if ($_ -ne $True) {Clear-Host; Write-Host "
        +------------------------------------------------------------------------------------------------------------------+
        | |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
        | |                                                                                                              | |
        | |                         __________                                                                           | |
        | |                         \______   \ ____   ____ _____    _____   ____                                        | |
        | |                          |       _// __ \ /    \ __  \  /     \_/ __ \                                       | |
        | |                          |    |   \  ___/|   |  \/ __ \|  Y Y  \  ___/                                       | |
        | |                          |____|_  /\___  >___|  (____  /__|_|  /\___  >                                      | |
        | |                                 \/     \/     \/     \/      \/     \/                                       | |
        | |                                 .____                        .__                                             | |
        | |                                 |    |    ____   ____ _____  |  |                                            | |
        | |                                 |    |   /  _ \_/ ___\ __  \ |  |                                            | |
        | |                                 |    |__(  <_> )  \___ / __ \|  |__                                          | |
        | |                                 |_______ \____/ \___  >____  /____/                                          | |
        | |                                         \/          \/     \/                                                | |
        | |         _____       .___      .__       .__          __                 __                                   | |
        | |        /  _  \    __| _/_____ |__| ____ |__| _______/  |_____________ _/  |_  ___________                    | |
        | |       /  /_\  \  / __ |/     \|  |/    \|  |/  ___/\   __\_  __ \__  \    __\/  _ \_  __ |                   | |
        | |      /    |    \/ /_/ |  Y Y  \  |   |  \  |\___ \  |  |  |  | \// __ \|  | (  <_> )  | \/                   | |
        | |      \____|__  /\____ |__|_|  /__|___|  /__/____  > |__|  |__|  (____  /__|  \____/|__|                      | |
        | |              \/      \/     \/        \/        \/                   \/                                      | |
        | |                                                                                                              | |
        | |º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º| |
        +------------------------------------------------------------------------------------------------------------------+
        |°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤|
        --------------------------------------------------------------------------------------------------------------------
        | |                                  Administrator account not found!                                            | |
        --------------------------------------------------------------------------------------------------------------------
        |°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤ø,¸¸,ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸¸,ø¤º°'°º¤¸,ø¤|
        --------------------------------------------------------------------------------------------------------------------"}
 else {$AdminAccount = Read-Host -Prompt 'Rename the local Administrator account to'; Rename-LocalUser -Name "Administrator" -NewName $AdminAccount | Get-LocalUser $AdminAccount; Write-Host "Your default administrator account has been renamed to: $AdminAccount"}
"""
                subprocess.call(['powershell.exe', adminacctrn])
                input('                 Press Enter to Return...')

            elif selection == 5:
                os.system("cls")
                pwrcfg = """ Write-Host -ForegroundColor Red "
             _.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._
          .--.---      - ---     --     ---   -----   - --       ----  ----   -     ---`-.
        ))((((¯`'·.¸°_«¤´¯`¤»°***************************************_°«¤´¯`¤»_°¸.·'´¯))))((
       ( #                 __________                                                     # )   
        )|#                \______   \______  _  __ ___________                          #|(    
       ( #                  |     ___/  _ \ \/ \/ // __ \_  __ \                          # )   
        )|#                 |    |  (  |_| )     /\  ___/|  | \/                         #|(   
       ( #                  |____|   \____/ \/\_/  \___  >__|                             # )   
        )|#                                            \/                                #|(    
       ( #________                _____.__                            __  .__             # )   
        )\_   ___ \  ____   _____/ ____\__| ____  __ ______________ _/  |_|__| ____   ___#|(    
       ( /    \  \/ /  _ \ /    \   __\|  |/ ___\|  |  \_  __ \__  \    __\  |/  _ \ /    \ )   
        )|     \___(  |_| )   |  \  |  |  / /_/  >  |  /|  | \// __ \|  | |  (  |_| )   |  \   
       ( #\______  /\____/|___|  /__|  |__\___  /|____/ |__|  (____  /__| |__|\____/|___|  /)   
        )|#      \/            \/        /_____/                   \/                    \/(    
       ( #                            __    __  .__                                       # )   
        )|#              ______ _____/  |__/  |_|__| ____    ____  ______                #|(    
       ( #              /  ___// __ \   __\   __\  |/    \  / ___\/  ___/                 # )   
        )|#             \___  \  ___/|  |  |  | |  |   |  \/ /_/  >___ \                 #|(    
       ( #             /____  >\___  >__|  |__| |__|___|  /\___  /____  >                 # )   
        )|#                 \/     \/                   \//_____/     \/                 #|(    
       (((((((¯`'·.¸°_«¤´¯`¤»°*****************************************_°«¤´¯`¤»_°¸.·'´¯)))))))"
Write-Host -ForegroundColor Red "        ))*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°•*☆((
       ((°°•*☆*•|                                                                   |°•*☆*))
        ))*☆*•°°|             Setting Hard Disk Power...                            |°•*☆(("
powercfg -x disk-timeout-ac 0
powercfg -x disk-timeout-dc 0
Write-Host -ForegroundColor Yellow "       ((°°•*☆*•|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°•*☆*))
        ))°°•*☆*|                                                                   |°•*☆((
       ((°°•*☆*•|             Setting Monitor Power...                              |°•*☆*))"
powercfg.exe -x -monitor-timeout-ac 0 
powercfg.exe -x -monitor-timeout-dc 0 
Write-Host -ForegroundColor Green "        ))*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*((
       ((°°•*☆*•|                                                                   |°•*☆*))                                  
        ))*☆*•°°|             Setting Sleep...                                      |°•*☆(("
powercfg.exe -x -standby-timeout-ac 0 
powercfg.exe -x -standby-timeout-dc 0 
Write-Host -ForegroundColor Blue "       ((°°•*☆*•|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°•*☆*))
        ))°°•*☆*|             Setting Hybernation...                                |°•*☆((
       ((°°•*☆*•|                                                                   |°•*☆*))"
powercfg.exe -x -hibernate-timeout-ac 0 
powercfg.exe -x -hibernate-timeout-dc 0
Write-Host -ForegroundColor Magenta "        ))*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*((  
       ((°°•*☆*•|             Setting USB ON BATTERY setting...                     |°•*☆*))
        ))*☆*•°°|                                                                   |°•*☆(("
powercfg /SETACVALUEINDEX SCHEME_CURRENT 2a737441-1930-4402-8d77-b2bebba308a3 48e6b7a6-50f5-4782-a5d4-53bb8f07e226 0
Write-Host -ForegroundColor DarkMagenta "       ((°°•*☆*•|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°•*☆*))
        ))°°•*☆*|             Setting USB PLUGGED IN...                             |°•*☆((
       ((°°•*☆*•|                                                                   |°•*☆*))
        ))((((¯`'·.¸°_«¤´¯`¤»°*****************************************_°«¤´¯`¤»_°¸.·'´¯))))(("
powercfg /SETDCVALUEINDEX SCHEME_CURRENT 2a737441-1930-4402-8d77-b2bebba308a3 48e6b7a6-50f5-4782-a5d4-53bb8f07e226 0 
Write-Host -foregroundColor Green "        |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||      
        ###################################################################################
        #       ___________.__       .__       .__               .___                     # 
        #       \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                     # 
        #        |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                      # 
        #        |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                      # 
        #        \___  /   |__|___|  /__/____  >___|  /\___  >____ |                      # 
        #            \/            \/        \/     \/     \/     \/                      # 
        ###################################################################################"
       """
                subprocess.call(['powershell.exe', pwrcfg])
                input("""            Press Enter to continue...""")
            elif selection == 6:
                os.system("cls")
                rencmd = """
                    $ErrorActionPreference= 'silentlycontinue'   
                    Write-Host -ForegroundColor Magenta "
                             _.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._
                            |-.---      - ---     --     ---   -----   --     ---`-.|
                            (((((¯`'·.¸°_«¤´¯`¤»°**************_°«¤´¯`¤»_°¸.·'´¯)))))
                            ||_______                                              ||
                            \______   \ ____   ____ _____    _____   ____          || 
                            ||       _// __ \ /    \ __  \  /     \_/ __ \         || 
                            ||    |   \  ___/|   |  \/ __ \|  Y Y  \  ___/         || 
                            ||____|_  /\___  >___|  (____  /__|_|  /\___  >        || 
                            ||      \/     \/     \/     \/      \/     \/         || 
                            ||_______                               __             || 
                            \_   ___ \  ____   _____ ______  __ ___/  |_  _________|| 
                            /    \  \/ /  _ \ /     \ ____ \|  |  \   __\/ __ \_  __ |
                            \     \___(  <_> )  Y Y  \  |_> >  |  /|  | \  ___/|  ||\/
                            |\______  /\____/|__|_|  /   __/|____/ |__|  \___  >__||| 
                           (||      \/             \/|__|                    \/    ||)
                            )|                                                     |(
                           ((((((¯`'·.¸°_«¤´¯`¤»°**************_°«¤´¯`¤»_°¸.·'´¯))))))
                            ))__________________Rename_Computer____________________(("  
                    $RNHost = Read-Host "                                Type the new Computer Name"
                    Rename-Computer -newname "$RNHost"
                    $error[0].Exception 
                    if ($_ -ne $True) {"Something went wrong..."}
                        else {Write-Host -Foregroundcolor Green "                            ((°°•*☆*•|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°•*☆*))
        ))°°•*☆*| Computer has been renamed to: $RNHost , Maybe you should reboot...    |°•*☆((
       ((°°•*☆*•|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°°•*☆*•°°°°•*☆*•°°|——  ◇  ——|°•*☆*))"}"""
                subprocess.call(['powershell.exe', rencmd])
                input("""           Press Enter to continue...""")
            elif selection == 7:
                dotnet = """
                
                Add-WindowsCapability –Online -Name NetFx3~~~~"""
                ofeat = 'optionalfeatures'
                subprocess.call(['powershell.exe', dotnet])
                input("""          Press Enter...""")
            elif selection == 8:
                os.system('cls')
                syscmd = """
Clear-Host
$ErrorActionPreference= 'silentlycontinue'
Write-Host  -Foreground Cyan " 
 #############################################################################################################
 #                                                                                                           #
 #                        _________                        __                                                #
 #                        \_   ___ \_______   ____ _____ _/  |_  ____                                        #
 #                        /    \  \/\_  __ \_/ __ \ __  \    __\/ __ \                                       #
 #                        \     \____|  | \/\  ___/ / __ \|  | \  ___/                                       #
 #                         \______  /|__|    \___  >____  /__|  \___  >                                      #
 #                               \/             \/     \/          \/                                        #
 #        __________                 __                         __________      .__        __                #
 #        \______   \ ____   _______/  |_  ___________   ____   \______   \____ |__| _____/  |_              #
 #         |       _// __ \ /  ___/\   __\/  _ \_  __ \_/ __ \   |     ___/  _ \|  |/    \   __\             #
 #         |    |   \  ___/ \___ \  |  | (  <_> )  | \/\  ___/   |    |  (  <_> )  |   |  \  |               #
 #         |____|_  /\___  >____  > |__|  \____/|__|    \___  >  |____|   \____/|__|___|  /__|               #
 #                \/     \/     \/                          \/                          \/                   #
 #                                                                                                           #
 #############################################################################################################
"
$chkptdsc=Read-Host -Prompt "       Name this checkpoint "
Checkpoint-Computer -Description "$chkptdsc"

    if ($_ -ne $True) {Write-Host -foreground -red "
        ##############################################################################
        ###                Something went wrong...                                  ##
        ############################################################################## 
        "}
        else {Write-Host " Successfully created System Restore Point..."}

Write-Host -foreground Green "
##############################################################################################################
                        ___________.__       .__       .__               .___                                 
                        \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                                 
                         |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                  
                         |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                  
                         \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                  
                             \/            \/        \/     \/     \/     \/ 
                                                              Creating Checkpoint...                                 
##############################################################################################################
"
 """
                subprocess.call(['powershell.exe', syscmd])
                input(""" Press Enter to continue...""")
            elif selection == 9:
                os.system('cls')
                devcertcmd = """$urls = @("devcert.csiweb.com")
                                foreach($url in $urls){
                                # Start-Process "C:\Program Files (x86)\Internet Explorer\iexplore.exe" $url
                                Start-Process iexplore.exe $url} """
                subprocess.call(['powershell.exe', devcertcmd])
                os.system('cls')
                input("""     

               ▓█████▄ ▓█████ ██▒   █▓ ██▓ ▄████▄  ▓█████                                           
               ▒██▀ ██▌▓█   ▀▓██░   █▒▓██▒▒██▀ ▀█  ▓█   ▀                                           
               ░██   █▌▒███   ▓██  █▒░▒██▒▒▓█    ▄ ▒███                                             
               ░▓█▄   ▌▒▓█  ▄  ▒██ █░░░██░▒▓▓▄ ▄██▒▒▓█  ▄                                           
               ░▒████▓ ░▒████▒  ▒▀█░  ░██░▒ ▓███▀ ░░▒████▒                                          
                ▒▒▓  ▒ ░░ ▒░ ░  ░ ▐░  ░▓  ░ ░▒ ▒  ░░░ ▒░ ░                                          
                ░ ▒  ▒  ░ ░  ░  ░ ░░   ▒ ░  ░  ▒    ░ ░  ░                                          
                ░ ░  ░    ░       ░░   ▒ ░░           ░                                             
                  ░       ░  ░     ░   ░  ░ ░         ░  ░                                          
                ░                 ░       ░                                                         
 ▄████▄  ▓█████  ██▀███  ▄▄▄█████▓ ██▓  █████▒██▓ ▄████▄   ▄▄▄     ▄▄▄█████▓ ██▓ ▒█████   ███▄    █ 
▒██▀ ▀█  ▓█   ▀ ▓██ ▒ ██▒▓  ██▒ ▓▒▓██▒▓██   ▒▓██▒▒██▀ ▀█  ▒████▄   ▓  ██▒ ▓▒▓██▒▒██▒  ██▒ ██ ▀█   █ 
▒▓█    ▄ ▒███   ▓██ ░▄█ ▒▒ ▓██░ ▒░▒██▒▒████ ░▒██▒▒▓█    ▄ ▒██  ▀█▄ ▒ ▓██░ ▒░▒██▒▒██░  ██▒▓██  ▀█ ██▒
▒▓▓▄ ▄██▒▒▓█  ▄ ▒██▀▀█▄  ░ ▓██▓ ░ ░██░░▓█▒  ░░██░▒▓▓▄ ▄██▒░██▄▄▄▄██░ ▓██▓ ░ ░██░▒██   ██░▓██▒  ▐▌██▒
▒ ▓███▀ ░░▒████▒░██▓ ▒██▒  ▒██▒ ░ ░██░░▒█░   ░██░▒ ▓███▀ ░ ▓█   ▓██▒ ▒██▒ ░ ░██░░ ████▓▒░▒██░   ▓██░
░ ░▒ ▒  ░░░ ▒░ ░░ ▒▓ ░▒▓░  ▒ ░░   ░▓   ▒ ░   ░▓  ░ ░▒ ▒  ░ ▒▒   ▓▒█░ ▒ ░░   ░▓  ░ ▒░▒░▒░ ░ ▒░   ▒ ▒ 
  ░  ▒    ░ ░  ░  ░▒ ░ ▒░    ░     ▒ ░ ░      ▒ ░  ░  ▒     ▒   ▒▒ ░   ░     ▒ ░  ░ ▒ ▒░ ░ ░░   ░ ▒░
░           ░     ░░   ░   ░       ▒ ░ ░ ░    ▒ ░░          ░   ▒    ░       ▒ ░░ ░ ░ ▒     ░   ░ ░ 
░ ░         ░  ░   ░               ░          ░  ░ ░            ░  ░         ░      ░ ░           ░ 
░                                                ░                                                  


                        Press Enter to continue...""")
            elif selection == 11:
                ninjagomenu()
            else:
                os.system('cls')
                adminmenu()
        except ValueError:
            os.system('cls')
            adminmenu()


def installappsmenu():
    appic = """
           ___________________________________________________________________________________
           |+_.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._+|
           |.-|---  --   - ---     --     ---   -----   - --  -    ----  ----   -     ----|-.|
           | )|       _____                .__  .__               __  .__                 |( |
           |( |      /  _  \ ______ ______ |  | |__| ____ _____ _/  |_|__| ____   ____    | )|
           | )|     /  /_\  \ ____ \ ____ \|  | |  |/ ___\ __  \    __\  |/  _ \ /    \   |( |
           |( |    /    |    \  |_> >  |_> >  |_|  \  \___ / __ \|  | |  (  <_> )   |  \  | )|
           | )|    \____|__  /   __/|   __/|____/__|\___  >____  /__| |__|\____/|___|  /  |( |
           |( |            \/|__|   |__|                \/     \/                    \/   | )|
           | )|              .___                 __         .__  .__                     |( |
           |( |              |   | ____   _______/  |______  |  | |  |   ______           | )|
           | )|              |   |/    \ /  ___/\   __\__  \ |  | |  |  /  ___/           |( |
           |( |              |   |   |  \ ___ \  |  |  / __ \|  |_|  |__\___ \            | )|
           | )|              |___|___|  /____  > |__| (____  /____/____/____  >           |( |
           |( |                       \/     \/            \/               \/            | )|
           | )|____ø¤º°'°º¤ø,¸,ø¤°'º¤ø,¸( •_•)O*¯·.¸.·´¯°Q(•_• ),¸,ø¤°'º¤ø,¸¸,ø¤º°'°º_____|( |
           |((  (__  _) ( __ _) (__  _) (__ _ ) *-.__.-*  ( _ __) (_  __) (_ __ ) (_  __)  ))|
           | )) ( _ __) (_  __) (__ __) *-._.-*     *     *-._.-* (__ __) (__  _) (__ _ ) (( |
           |((  (__  _) (_ _ _) *-._.-*    *         .            *-._.-* (_ _ _) (_  __)  ))|
           | )) (_ ___) *-._.-*      1. Java Runtime       *         .    *-._.-* (___ _) (( |
           |((| *-._.-*      .   *   2. Adobe__DC__(Reader)_                      *-._.-* |))|
           | )|         *      .     3. Microsoft____Silveright_   *      .         .     |( |
           |( |       .    .         4. Return__to__Top____ Menu____    .        |        | )|
           | )|   *           ^    .  ^   .           .                 .      -(-)-      |( |
           |( | .         *  / \_ *  / \_         *        *   /\*__        *    |    .   | )|
           | )|      *      /    \  /    \  .     .     .    _/  /  \  *  .    .          |( |
           |( |       .   /\/\  /\/ :' __ \_  `          _^/  ^/    `|-.     .      *     | )|
           | )|   .      /    \/  \  _/  \-'\_     *   _/.' ^_   \_   -.'\  *          .  |( |
           |( |  .      /|        /\  .-   `. \        /     _/ \_-. `_/   \      .       | )|
           | )|    *  /  `-.__ ^   / .-'.--\ (~~  ~~~~ ~~) `--./ .-'  `-  |\_             |( |
           |( |~~~~~/        `.  / /       (~~__~~~~_______~~~~)'-._ `._  \  \~~~~~~~~~~~~| )|
           | )|   ............-------------                '''''''''''''''' ~~~~~~~~~~    |( |
           |( |  ~~~~~~~~~ ~~~~~        ~~~~~~ ~~~~~~~~~~~   __--_________ ~~~~~    ~~~ ~~| )|
           | )|  ~~    ~~~~~~~~     ~~~~~~~   ~~~~~~~~~   ~~~~~~~~~~      ~~~~~~~     ~~~ |( |
           |( |__.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-._.-=-.__| )|
           |/////////////////////////////////////////////////////////////////////////////////|"""
    while True:
        try:
            os.system('cls')
            print(appic)
            selection = int(input("                      Enter choice 1-4 :"))
            if selection == 1:
                javainst = """$ErrorActionPreference= 'silentlycontinue'
                Clear-Host
Write-Host "
   
         (((((¯`'·.¸°_«¤´¯`¤»°**********************_°«¤´¯`¤»_°¸.·'´¯)))))
         ||                                                             || 
       __||               __         .__  .__         ____.             ||       
      |__||____   _______/  |______  |  | |  |       |    |____ ___  ___||__   
      |  |/    \ /  ___/\   __\__  \ |  | |  |       |    \__  \   \/ /\__  \  
      |  |   |  \ ___ \  |  |  / __ \|  |_|  |__ /\__|    |/ __  \   /  / __ \_
      |__|___|  /____  > |__| (____  /____/____/ \________(____  /\_/  (____  /
         ||   \/     \/            \/                          \/       ||  \/ 
         ||-------------------------------------------------------------||
         ||            install Java Runtime Environment                ||"
$workd = "c:\wkdir"

# Check if work directory exists if not create it
Write-Host "         ||=============================================================||
         ||+               Creating working directory...               +||
         ||=============================================================|| "
If (!(Test-Path -Path $workd -PathType Container))
{ 
New-Item -Path $workd  -ItemType directory 
}

#create config file for silent install
$text = '
INSTALL_SILENT=Disable
AUTO_UPDATE=Enable
SPONSORS=Disable
REMOVEOUTOFDATEJRES=1
'
$text | Set-Content "$workd\jreinstall.cfg"
    
#download executable, this is the small online installer
Write-Host "         ||+ Downloading Java now... Please wait for process to finish +||
        =================================================================="
$source = "http://javadl.oracle.com/webapps/download/AutoDL?BundleId=230511_2f38c3b165be4555a1fa6e98c45e0808"
$destination = "$workd\jreInstall.exe"
$client = New-Object System.Net.WebClient
$client.DownloadFile($source, $destination)

#install silently
Write-Host "         ||+ Installing Java now... Please wait for process to finish  +||
        ================================================================="
Start-Process -FilePath "$workd\jreInstall.exe" -ArgumentList INSTALLCFG="$workd\jreinstall.cfg"

# Wait 120 Seconds for the installation to finish
#Write-Host "        ||+        Waiting for you to finish installing java...       +||
#        =================================================================="
#Start-Sleep -s 90
#Write-Host "        ||+        Press Enter after install...                       +||
#        =================================================================="
# Remove the installer
Write-Host "         ||+        Will remove working directory after finish...      +||
        =================================================================="
Write-Host "         |((((¯`'·.¸°_«¤´¯`¤»°************************_°«¤´¯`¤»_°¸.·'´¯))))||
        __________________________________________________________________"
pause
rm -Force $workd\jre* """
                os.system('cls')
                subprocess.call(['powershell.exe', javainst])
                installappsmenu()
            elif selection == 2:
                adobeinst = """
Clear-Host
Write-Host "   (((((¯`'·.¸°_«¤´¯`¤»°*************************_°«¤´¯`¤»_°¸.·'´¯)))))
    ||   _____       .___    ___.              ________  _______||   
    ||  /  _  \    __| _/____\_ |__   ____     \______ \ \_   ___ \  
    || /  /_\  \  / __ |/  _ \| __ \_/ __ \     |    |  \/    \ |\/  
    ||/    |    \/ /_/ (  <_> ) \_\ \  ___/     |    `   \     \||__ 
    ||\____|__  /\____ |\____/|___  /\___  >   /_______  /\______  / 
    ||        \/      \/          \/     \/            \/       |\/  
    ||   ___   __________                   .___              __||    
    ||  /  /   \______   \ ____ _____     __| _/___________   \  \     
    || /  /     |       _// __ \ __  \   / __ |/ __ \_  __ \   \  \     
    ||(  (      |    |   \  ___/ / __ \_/ /_/ \  ___/|  | \/    )  )    
    || \  \     |____|_  /\___  >____  /\____ |\___  >__|      /  /     
    ||  \__\         \/     \/     \/      \/    \/           /__/         
    ||----------------------------------------------------------||    
    ||.-=-._.-=-._.-=-._.-=-._.-=-..-=-._.-=-._.-=-._.-=-._.-=-.||
    ||.-.---   ---     --     ---   -----   - --       ----  .-.||
    ||----------------------------------------------------------||
    ||            Install Adobe DC Reader                       ||"

# working directory path
$workd = "c:\wkdir"

# Check if work directory exists if not create it
Write-Host "   ||=============================================================||
   ||+               Creating working directory...               +||
   ||=============================================================|| "
If (!(Test-Path -Path $workd -PathType Container))
{ 
New-Item -Path $workd  -ItemType directory 
}

#create config file for silent install
$text = '
INSTALL_SILENT=Disable
AUTO_UPDATE=Enable
SPONSORS=Disable
REMOVEOUTOFDATEJRES=1
'
$text | Set-Content "$workd\ReaderDC.cfg"
    
#download executable, this is the small online installer
Write-Host "   ||+ Downloading DC   now... Please wait for process to finish +||
   =================================================================="
$source = "http://ardownload.adobe.com/pub/adobe/reader/win/AcrobatDC/1502320053/AcroRdrDC1502320053_en_US.exe"
$destination = "$workd\ReaderDC.exe"
$client = New-Object System.Net.WebClient
$client.DownloadFile($source, $destination)

#install silently
Write-Host "   ||+ Installing DC   now... Please wait for process to finish  +||
   ================================================================="
Start-Process -FilePath "$workd\ReaderDC.exe" -ArgumentList INSTALLCFG="$workd\ReaderDC.cfg"

# Remove the installer
Write-Host "   ||+        Press Enter to remove working files...             +||
   ================================================================== "
Write-Host "   |((((¯`'·.¸°_«¤´¯`¤»°************************_°«¤´¯`¤»_°¸.·'´¯))))||
   __________________________________________________________________ "
Write-Host "       ###################################################################################
        #       ___________.__       .__       .__               .___                     # 
        #       \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                     # 
        #        |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                      # 
        #        |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                      # 
        #        \___  /   |__|___|  /__/____  >___|  /\___  >____ |                      # 
        #            \/            \/        \/     \/     \/     \/                      # 
        ###################################################################################"

pause
rm -Force $workd\ReaderDC.exe"                """
                os.system('cls')
                subprocess.call(['powershell.exe', adobeinst])
            elif selection == 3:
                os.system('cls')

            else:
                print(appic + 'Invalid choice. Enter selection')
                input("            Please press ENTER to continue...")
                exit()
        except ValueError:
            os.system('cls')
            installappsmenu()


def nupoint():
    nppcmd = """
             $ErrorActionPreference= 'silentlycontinue'
             If (Test-Path "$env:USERPROFILE\DoNotDelete") {
         cls
         write-host -ForegroundColor Red  "
         ##############################################################################################################################################
         #                 ___________.__    .__           _________            .__        __    .__                                                  #
         #                 \__    ___/|  |__ |__| ______  /   _____/ ___________|__|______/  |_  |  |__ _____    ______                               #
         #                   |    |   |  |  \|  |/  ___/  \_____  \_/ ___\_  __ \  \____ \   __\ |  |   \__  \  /  ___/                               #
         #                   |    |   |   Y  \  |\___ \   /        \  \___|  | \/  |  |_> >  |   |   Y  \/ __ \_\___ \                                #
         #                   |____|   |___|  /__/____  > /_______  /\___  >__|  |__|   __/|__|   |___|  (____  /____  >                               #
         #                                 \/        \/          \/     \/         |__|               \/     \/     \/                                #
         #___.                          ___________                            __             .___    _____  .__                            .___      #
         #\_ |__   ____   ____   ____   \_   _____/__  ___ ____   ____  __ ___/  |_  ____   __| _/   /  _  \ |  |_______   ____ _____     __| _/__.__.#
         # | __ \_/ __ \_/ __ \ /    \   |    __)_\  \/  // __ \_/ ___\|  |  \   __\/ __ \ / __ |   /  /_\  \|  |\_  __ \_/ __ \ __  \   / __ <   |  |#
         # | \_\ \  ___/\  ___/|   |  \  |        \>    <\  ___/\  \___|  |  /|  | \  ___// /_/ |  /    |    \  |_|  | \/\  ___/ / __ \_/ /_/ |\___  |#
         # |___  /\___  >\___  >___|  / /_______  /__/\_  \___  >\___  >____/ |__|  \___  >____ |  \____|__  /____/__|    \___  >____  /\____ |/ ____|#
         #     \/     \/     \/     \/          \/      \/    \/     \/                 \/     \/          \/                 \/     \/      \/\/     #
         #     If you want to set permissions on this machine again, just delete the folder DoNotDelete in the current user profile directory.        #
         ##############################################################################################################################################";
         ii $env:USERPROFILE
           }  Else {
         cls
         write-host -ForegroundColor Blue "
         |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
         #         _________                        __  .__                                  #
         #         \_   ___ \_______   ____ _____ _/  |_|__| ____    ____                    #
         #         /    \  \/\_  __ \_/ __ \ __  \    __\  |/    \  / ___\                   #
         #         \     \____|  | \/\  ___/ / __ \|  | |  |   |  \/ /_/  >                  #
         #          \______  /|__|    \___  >____  /__| |__|___|  /\___  /                   #
         #                 \/             \/     \/             \//_____/                    #
         # ________  .__                       __               .__                          # 
         # \__     \ |__|______   ____   _____/  |_  ___________|__| ____   ______           #  
         #  |   _   \|  \_  __ \_/ __ \_/ ___\   __\/  _ \_  __ \  |/ __ \ /  ___/           #  
         #  |  |_|   \  ||  | \/\  ___/\  \___|  | (  <_> )  | \/  \  ___/ \___ \            #  
         # /_______  /__||__|    \___  >\___  >__|  \____/|__|  |__|\___  >____  > /\  /\  /\#  
         #         \/                \/     \/                          \/     \/  \/  \/  \/#  
         /////////////////////////////////////////////////////////////////////////////////////"


         md "c:\program files (x86)\Computer Services, Inc"
         $error[0].Exception

         md "C:\programData\Computer Services, Inc"
         $error[0].Exception

         md "C:\Program Files (x86)\Common Files\CSI Shared"
         $error[0].Exception

         md "$env:USERPROFILE\AppData\Local\Computer Services, Inc" 
         $error[0].Exception

         md "$env:USERPROFILE\DoNotDelete"
         $error[0].Exception


         write-host -ForegroundColor Green "
         ##############################################################################################################
         #                        ___________.__       .__       .__               .___                               #  
         #                        \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                               #  
         #                         |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                #  
         #                         |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                #  
         #                         \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                #  
         #                             \/            \/        \/     \/     \/     \/                                #  
         #                                 verifying and creating directories...                                      # 
         ##############################################################################################################" 
         pause 
         cls
         write-host -BackgroundColor Black -ForegroundColor Blue "
         /////////////////////////////////////////////////////////////////////////////
          ___________________________________________________________________________
         |         ________                     __  .__                              |
         |        /  _____/___________    _____/  |_|__| ____    ____                |
         |       /   \  __\_  __ \__  \  /    \   __\  |/    \  / ___\               |
         |       \    \_\  \  | \// __ \|   |  \  | |  |   |  \/ /_/  >              |
         |        \______  /__|  (____  /___|  /__| |__|___|  /\___  /               |
         |               \/           \/     \/             \//_____/                |
         |__________                     .__              .__                        |
         |\______   \ ___________  _____ |__| ______ _____|__| ____   ____   ______  |
         | |     ___// __ \_  __ \/     \|  |/  ___//  ___/  |/  _ \ /    \ /  ___/  |
         | |    |   \  ___/|  | \/  Y Y  \  |\___ \ \___ \|  (  <_> )   |  \ ___ \   | 
         | |____|    \___  >__|  |__|_|  /__/____  >____  >__|\____/|___|  /____  >  |
         |               \/            \/        \/     \/               \/     \/   |
         |   to the C:\ProgramData\Computer Services, Inc folder and sub folders     |
         |                  for Domain Admins and Domain Users                       |
         +___________________________________________________________________________+
         /////////////////////////////////////////////////////////////////////////////"

         Takeown /f "C:\ProgramData\Computer Services, Inc" /r /a /d y
          $error[0].Exception

         ICACLS "C:\ProgramData\Computer Services, Inc" /grant:r '"Domain Admins":(OI)(CI)F'
          $error[0].Exception

         ICACLS "C:\ProgramData\Computer Services, Inc" /grant:r 'SYSTEM:(OI)(CI)F'
         $error[0].Exception

         ICACLS "C:\ProgramData\Computer Services, Inc" /grant:r '"Domain Users":(OI)(CI)F'
         $error[0].Exception

         ICACLS "C:\ProgramData\Computer Services, Inc" /setowner "Domain Users" /T
          $error[0].Exception
         write-host -ForegroundColor Green "
         ##############################################################################################################
         #                        ___________.__       .__       .__               .___                               #  
         #                        \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                               #  
         #                         |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                #  
         #                         |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                #  
         #                         \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                #  
         #                             \/            \/        \/     \/     \/     \/                                #  
         #                            taking ownership of Application directory...                                    # 
         ############################################################################################################## "
         pause

         cls
         write-host -ForegroundColor Blue "
         _________________________________________________________________________________________________________
         /___________       __   .__                    _____                                   .__    .__        /
         /\__    ___/____  |  | _|__| ____    ____     /     \__  _  ______   ___________  _____|  |__ |__|_____  /
         /  |    |  \__  \ |  |/ /  |/    \  / ___\   /  _    \ \/ \/ /    \_/ __ \_  __ \/  ___/  |  \|  \____ \ /
         /  |    |   / __ \|    <|  |   |  \/ /_/  > /  |_|    \     /   |  \  ___/|  | \/\___ \|   Y  \  |  |_> >/
         /  |____|  (____  /__|_ \__|___|  /\___  /  \_________/\/\_/|___|  /\___  >__|  /____  >___|  /__|   __/ /
         /               \/     \/       \//_____/                        \/     \/           \/     \/   |__|    /
         /               of Application Data folders                                                              /
         /________________________________________________________________________________________________________/"


         Takeown /f "C:\ProgramData\Application Data\Computer Services, Inc" /r /a /d y
          $error[0].Exception
         ICACLS "C:\ProgramData\Application Data\Computer Services, Inc" /grant:r '"Domain Admins":(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\ProgramData\Application Data\Computer Services, Inc" /grant:r 'SYSTEM:(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\ProgramData\Application Data\Computer Services, Inc" /grant:r '"Domain Users":(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\ProgramData\Application Data\Computer Services, Inc" /setowner "Domain Users" /T
          $error[0].Exception

         write-host -ForegroundColor Green "
         ##############################################################################################################
         #                        ___________.__       .__       .__               .___                               # 
         #                        \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                               # 
         #                         |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                # 
         #                         |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                # 
         #                         \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                # 
         #                             \/            \/        \/     \/     \/     \/                                # 
         #                            taking ownership of Application Data directory...                               #
         ##############################################################################################################
         "
         pause

         cls

         write-host -ForegroundColor Blue "
         _________________________________________________________________________________________________________
        | ___________       __   .__                 ________                                   .__    .__        |
        | \__    ___/____  |  | _|__| ____    ____   \_____  \__  _  ______   ___________  _____|  |__ |__|_____  |
        |   |    |  \__  \ |  |/ /  |/    \  / ___\   /   |   \ \/ \/ /    \_/ __ \_  __ \/  ___/  |  \|  \____ \ |
        |   |    |   / __ \|    <|  |   |  \/ /_/  > /    |    \     /   |  \  ___/|  | \/\___ \|   Y  \  |  |_> >|
        |   |____|  (____  /__|_ \__|___|  /\___  /  \_______  /\/\_/|___|  /\___  >__|  /____  >___|  /__|   __/ |
        |                \/     \/       \//_____/           \/           \/     \/           \/     \/   |__|    |
        |      of AppData Folder...                                                                               |
        |_________________________________________________________________________________________________________|"
         Takeown /f "%USERPROFILE%\AppData\Local\Computer Services, Inc" /r /a /d y
          $error[0].Exception
         ICACLS "%USERPROFILE%\AppData\Local\Computer Services, Inc" /grant:r '"Domain Admins":(OI)(CI)F'
          $error[0].Exception
         ICACLS "%USERPROFILE%\AppData\Local\Computer Services, Inc" /grant:r 'SYSTEM:(OI)(CI)F'
          $error[0].Exception
         ICACLS "%USERPROFILE%\AppData\Local\Computer Services, Inc" /grant:r '"Domain Users":(OI)(CI)F'
          $error[0].Exception
         ICACLS "%USERPROFILE%\AppData\Local\Computer Services, Inc" /setowner "Domain Users" /T
          $error[0].Exception

         write-host -ForegroundColor Green "
         ##############################################################################################################
         #                        ___________.__       .__       .__               .___                               # 
         #                        \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                               # 
         #                         |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                # 
         #                         |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                # 
         #                         \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                # 
         #                             \/            \/        \/     \/     \/     \/                                #
         #                             taking ownership of AppData folder...                                          #
         ##############################################################################################################
                       "
         pause

         cls
         Write-Host -ForegroundColor Blue "
         ##############################################################################################################
         / ___________       __   .__                 ________                                   .__    .__           /
         / \__    ___/____  |  | _|__| ____    ____   \_____  \__  _  ______   ___________  _____|  |__ |__|_____     /
         /   |    |  \__  \ |  |/ /  |/    \  / ___\   /   |   \ \/ \/ /    \_/ __ \_  __ \/  ___/  |  \|  \____ \    /
         /   |    |   / __ \|    <|  |   |  \/ /_/  > /    |    \     /   |  \  ___/|  | \/\___ \|   Y  \  |  |_> >   /
         /   |____|  (____  /__|_ \__|___|  /\___  /  \_______  /\/\_/|___|  /\___  >__|  /____  >___|  /__|   __/    /
         /                \/     \/       \//_____/           \/           \/     \/           \/     \/   |__|       /
         /                                               and setting permissions on Program files shared folders...   /
         ##############################################################################################################"
         Takeown /f "C:\Program Files (x86)\Common Files\CSI Shared" /r /a /d y
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Common Files\CSI Shared" /grant:r '"Domain Admins":(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Common Files\CSI Shared" /grant:r 'SYSTEM:(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Common Files\CSI Shared" /grant:r '"Domain Users":(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Common Files\CSI Shared" /setowner "Domain Users" /T
          $error[0].Exception
         write-host -ForegroundColor Green "
         ###################################################################################################################
         \                    ___________.__       .__       .__               .___                                        /
         \                    \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                                        /
         \                     |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                         /
         \                     |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                         /
         \                     \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                         /
         \                         \/            \/        \/     \/     \/     \/                                         /
         |                        taking ownership of CSI Shared folders...                                                |
         ###################################################################################################################"
         pause

         cls
         write-host -ForegroundColor Magenta "
         ###################################################################################################################
         #___________       __   .__                 ________                                   .__    .__                 #
         #\__    ___/____  |  | _|__| ____    ____   \_____  \__  _  ______   ___________  _____|  |__ |__|_____           #
         #  |    |  \__  \ |  |/ /  |/    \  / ___\   /   |   \ \/ \/ /    \_/ __ \_  __ \/  ___/  |  \|  \____ \          #
         #  |    |   / __ \|    <|  |   |  \/ /_/  > /    |    \     /   |  \  ___/|  | \/\___ \|   Y  \  |  |_> >         #
         #  |____|  (____  /__|_ \__|___|  /\___  /  \_______  /\/\_/|___|  /\___  >__|  /____  >___|  /__|   __/          #
         #               \/     \/       \//_____/           \/           \/     \/           \/     \/   |__|             #
         #                                              and setting permissions on Program files folders.....              #
         ###################################################################################################################"
         Takeown /f "C:\Program Files (x86)\Computer Services, Inc" /r /a /d y
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Computer Services, Inc" /grant:r '"Domain Admins":(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Computer Services, Inc" /grant:r 'SYSTEM:(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Computer Services, Inc" /grant:r '"Domain Users":(OI)(CI)F'
          $error[0].Exception
         ICACLS "C:\Program Files (x86)\Computer Services, Inc" /setowner "Domain Users" /T
          $error[0].Exception
         pause
         cls
         write-host -ForegroundColor Green "

         ###################################################################################################################
         #                                                                       xmHTTTTT%ms.                              #
         #                                                                    z?!!!!!!!!!!!!!!?m                           #
         #                                                                  z!!!!!!!!!!!!!!!!!!!!%                         #
         #                                                               eHT!!!!!!!!!!!!!!!!!!!!!!!L                       #
         #                                                              M!!!!!!!!!!!!!!!!!!!!!!!!!!!>                      #
         #                                                           z!!!!!!!!!!XH!!!!!!!!!!!!!!!!!!X                      #
         #                                                            SSF*tX!!W?!!!!!!!!!!!!!!!!!!!!!                      #
         #                                                           >     M!!!   4SSNX!!!!!!!!!!!!!t                      #
         #                                                           tmem?!!!!?    **   *X!!!!!!!!!!F                      #
         #                                                      um@T!!!!!!!!!!!!s.      M!!!!!!!!!!F                       #
         #                                                   .#!!!!!!!!!!!!!!!XX!!!!?mM!!!!!!!!!!t~                        #
         #                                                  M!!!@!!!!X!!!!!!!!!!*U!!!!!!!!!!!!!!@                          #
         #                                                 M!!t%!!!W?!!!XX!!!!!!!!!!!!!!!!!!!!X*                           #
         #                                                :!!t?!!!@!!!!W?!!!!XWWUX!!!!!!!!!!!t                             #
         #                                                4!!$!!!M!!!!8!!!!!@SSSSSSNX!!!!!!!!-                             #
         #                                                 *P*!!!$!!!!E!!!!9SSSSSSSS%!!!!!!!K                              #
         #                                                    *H**X!!X&!!!!R**SSS*#!!!!!!!!!>                              #
         #                                                        'TT!?W!!9!!!!!!!!!!!!!!!!M                               #
         #                                                        '!!!!!!!!!!!!!!!!!!!!!!!!F                               #
         #                                                        '!!!!!!!!!!!!!!!!!!!!!!!!>                               #
         #                                                        '!!!!!!!!!!!!!!!!!!!!!!!M                                #
         #                                                        J!!!!!!!!!!!!!!!!!!!!!!!F K!%n.                          #
         #         @!!!!!??m.                                  x?F*X!!!!!!!!!!!!!!!!!!!!HP X!!!!!!?m.                      #
         #Z?L      *%!!!!!!!!!?s                            .@!\~ MB!!!!!!!!!!!!!!!!!U#!F X!!!!!!!!X#!%.                   #
         #E!!N!k     *t!!!!!!!!!?:                       zTX?!t~ M!t!!!!!!!!!!!!!!UM!!!F 4!!!!!!!!t%!!!!?.                 #
         #!!!!!!hzh.   *X!!!!!!!!!S                  .+?!!3?!X  Z!!!B!!!!!!!!!!UM!!!!!* 4!!!!!!!!t?!!!!!!!h                #
         #?!!!!!!!!!*!?L %!!!!!!!!?               .+?!!!!3!!\  P!!!!?X!!!!!!U#!!!!!!X* 4!!!!!!!!\%!!!!!!!!!?               #
         #'X!!!!!!!!!!!!?TTTT*U!!!!k            z?!!!!!!t!!!- J!!!!!!9!!X@T!!!!!!!!X~ d!!!!!!!!!%!!!!!!!!!!!!L             #
         # 4!!!!!!!!!!!!!!!!!!!!!!!M          'W!!!!!!!X%!!P  %!!!!!!!T!!!!!!!!!!!X~ J!!!!!!!!!P!!!!!!!!!!!!!!!            #
         #  5!!!!!!!!!!!!!!!!!!!!!!!?m.       .@Ti!!!!!Z!!t  d!!!!!!!!!!!!!!!!!!!X-.JUUUUX!!!!J!!!!!!!!!!!!!!!!!           #
         #   %!!!!!!!!!!!!!!!!!!!!!!!!!!!TnzT!!!!!#/!!?!!X*  ^S=4UU!!!!!!!!!!U@T!!!!!!!!!!!!Th2!!!!!!!!!!!!!!!!!!          #
         #    *t!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!?K!K!!f               ***#X!!!!!!!!!!!!!!!!!?t!!!!!!!!!!!!!!!!(>        #
         #       *U!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!$!!F                      *tX!!!!!!!!!!!!!!!!b!!!!!!!!!!!!!!!(>       #
         #           **tUUX!X!!!!!!!!!!!!!!!!!!!!!!!!$!Z                          ^4!!!!!!!!!!!!!!!N!!!!!!!!!!!!!!!!       #
         #                 %!!!!!!!!!!!!!!!!!!!!!!!!X!X                              %W@@WX!!!!!!!!!N!!!!!!!!!!!!!!!       #
         #                  *X!!!!!!!!!!!!!!!!!!!!!@!!*        ..    ..  :m.. ETThmuM!!!!!!!!!!!!!!!!@m@*TTTT?!!!W!!       #
         #                    %!!!!!!!!!!!!!!!!!!W?!!X         M!!!TT?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!9UU!!!!!!!!!M!f       #
         #                     't!!!!!!!!!!!!!!!P!!!!X          5!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!?NX!!!!!!L        #
         #                       *W!!!!!!!!!!!X#!!!!!R           *X!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!R!!!!!t        #
         #                         ^*X!!!!!!!t%!!!!!h              %X!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!>       #
         #                             **U!!M!!!!!!X~ :?!!!T!+s...   *X!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!        #
         #                                 :?!!!!!!> :?!!!!!!!!!!!!!!!!?tX!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!>       #
         #                                 %!!!!!!F .%!!!!!!!!!!!!!!!!!!!!!#4U!!!!!!!!!!!!U!!!!!!!!!!!!!!!!!!!!!!!!~       #
         #                                K!!!!!!Z  K!!!!!!!!!!!!!!!!!!!!!!!  F!!!!!?!!?X!!!!!!!!!!!!!!!!!!!!!!!!!Z        #
         #                               X!!!!!!t  H!!!!!!!!!!!!!!!!!!!!!!!!> !!!!!!!!!!!W!!!!!!!!!!!!!!!!!!!!!!!t         #
         #                               %!!!!!!F :!!!!!!!!!!!!!!!!!!!!!!!!!> !!!!!!!!!!!!#X!!!!!!!!!!!!!!!!!!!!X          #
         #                              '!!!!!!X  K!!!!!!!!!!!!!!!!!!!!!!!!!> K!!!!!!!!!!!!!?W!!!!!!!!!!!!!!!!X*           #
         ###################################################################################################################
         #__________     .__    .______.                            _____                                                  #
         #\____    /____ |__| __| _/\_ |__  __ _________  ____     /  _  \ ______ _____________  _______  __ ____   ______ #
         #  /     //  _ \|  |/ __ |  | __ \|  |  \_  __ \/ ___\   /  /_\  \ ____ \ ____ \_  __ \/  _ \  \/ // __ \ /  ___/ #
         # /     /(  <_> )  / /_/ |  | \_\ \  |  /|  | \/ /_/  > /    |    \  |_> >  |_> >  | \(  <_> )   /\  ___/ \___ \  #
         #/_______ \____/|__\____ |  |___  /____/ |__|  \___  /  \____|__  /   __/|   __/|__|   \____/ \_/  \___  >____  > #
         #        \/             \/      \/            /_____/           \/|__|   |__|                          \/     \/  #
         ###################################################################################################################
         \                    ___________.__       .__       .__               .___                                        /
         \                    \_   _____/|__| ____ |__| _____|  |__   ____   __| _/                                        /
         \                     |    __)  |  |/    \|  |/  ___/  |  \_/ __ \ / __ |                                         /
         \                     |     \   |  |   |  \  |\___ \|   Y  \  ___// /_/ |                                         /
         \                     \___  /   |__|___|  /__/____  >___|  /\___  >____ |                                         /
         \                         \/            \/        \/     \/     \/     \/                                         /
         |              Finished taking ownership and setting permissions on NuPoint directories                           |
         ################################################################################################################### "
         pause
         cls
         } """
    chkfldprm = """Get-Acl -Path "$env:USERPROFILE\AppData\Local\Computer Services, Inc", "c:\program files (x86)\Computer Services, Inc", "C:\ProgramData\Computer Services, Inc", "C:\ProgramData\Application Data\Computer Services, Inc","C:\Program Files (x86)\Common Files\CSI Shared" | Format-Table -Wrap"""
    os.system("cls")
    print("""
        ##############################################################################################################################
        #          ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++          #
        #          ++                                                                             =+                     ++          #
        #          ++                                                                        =++++++                     ++          #
        #          ++                                                                  +++++0000000+                     ++          #
        #          ++                 =====____      ____=====____    _______    _+++00000000000000+                     ++          #
        #          ++          _=++000000000000= __+++000000000000+   +00000=    =00000000000000000+           ==++++    ++          #
        #          ++        _+0000000+    +00+ _+0000000     ++00+   +00000=    =00000000000000000+_______===+++000+    ++          #
        #          ++      _+000000+            _0000000              +00000=    =000000000000000000++00000000000000+    ++          #
        #          ++      =00000+              _00000000++=__        +00000=    =0000000000000000000000000000000000+    ++          #
        #          ++      +00000=               _+00000000000++=     +00000=    =0000000000000000000000000000000000+    ++          #
        #          ++      000000_                 _++00000000000++_  +00000=    =0000000000000000000000000000000000+    ++          #
        #          ++      +00000+_                    _+++000000000= +00000=     ++++++++00000000000000000000000000+    ++          #
        #          ++       +00000+_                       _=+000000+ +00000=            =00000000000000000000000000+    ++          #
        #          ++        +000000+++====++++  _+++++====++0000000  +00000=            =00000000000000000000000000+    ++          #
        #          ++          =+000000000000++  +000000000000000++   +00000=            =00000000000000000000000000+    ++          #
        #          ++             _0000000000++    ==0000000000=      =+++++             =00000000000000000000000000+    ++          #
        #          ++                                                                     ++++0000000000000000000000+    ++          #
        #          ++                                                                            =++++++000000000000+    ++          #
        #          ++                                                                                      ==++++++0+    ++          #
        #          ++                                                                                             ==+    ++          #
        #          ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++          #
        #                            ____ ___      .__                                  .__                                          #
        #                           |    |   \____ |__|__  __ ___________  ___________  |  |                                         #
        #                           |    |   /    \|  \  \/ // __ \_  __ \/  ___/\__  \ |  |                                         #
        #                           |    |  /   |  \  |\   /\  ___/|  | \/\___ \  / __ \|  |__                                       #
        #                           |______/|___|  /__| \_/  \___  >__|  /____  >(____  /____/                                       #
        #                                        \/              \/           \/      \/                                             #
        #     _______       __________      .__        __      ____    __________                                             __     #
        #     \      \  __ _\______   \____ |__| _____/  |_   /  _ \   \______   \_____    ______ ____________   ____________/  |_   #
        #     /   |   \|  |  \     ___/  _ \|  |/    \   __\  >  _ </\  |     ___/\__  \  /  ___//  ___/\____ \ /  _ \_  __ \   __\  #
        #    /    |    \  |  /    |  (  <_> )  |   |  \  |   /  <_\ \/  |    |     / __ \_\___ \ \___ \ |  |_> >  <_> )  | \/|  |    #
        #    \____|__  /____/|____|   \____/|__|___|  /__|   \_____\ \  |____|    (____  /____  >____  >|   __/ \____/|__|   |__|    #
        #            \/                             \/              \/                 \/     \/     \/ |__|                         #
        #                      __________                     .__              .__                                                   #
        #                      \______   \ ___________  _____ |__| ______ _____|__| ____   ____   ______                             #
        #                       |     ___// __ \_  __ \/     \|  |/  ___//  ___/  |/  _ \ /    \ /  ___/                             #
        #                       |    |   \  ___/|  | \/  Y Y  \  |\___ \ \___ \|  (  <_> )   |  \___  \                              #
        #                       |____|    \___  >__|  |__|_|  /__/____  >____  >__|\____/|___|  /____  >                             #
        #                                     \/            \/        \/     \/               \/     \/                              #
        ##############################################################################################################################""")
    input("Please press ENTER to continue...")
    subprocess.call(['powershell.exe', nppcmd])
    input("Please press ENTER to continue...")
    os.system("cls")
    subprocess.run(['powershell.exe', chkfldprm])
    input("Please press ENTER to continue...")





ninjagomenu()
